app/controllers/charities_controller.rb

  def event_charities
    @event = Event.find_by_id params[:event_id] || not_found
    @selected_charities = params[:selected_charities] ? Charity.find(params[:selected_charities]) : []
---
SELECT `events`.* FROM `events` WHERE `events`.`deleted_at` IS NULL AND `events`.`id` = 47 LIMIT 1
SELECT `charities`.* FROM `charities` WHERE `charities`.`deleted_at` IS NULL AND `charities`.`id` IN (126, 103, 105)