app/controllers/events_controller.rb

INSERT INTO `events` (`charity_donation_percent`, `child_dob`, `child_full_name`, `child_pronoun`, `contributions_locked`, `created_at`, `deleted_at`, `donation_fund_locked`, `end_time`, `event_date`, `event_sequence`, `gift_fund_locked`, `host_name`, `icon_picture_id`, `invite_option`, `location_address`, `location_name`, `magic_phrase`, `other_page_content`, `package_id`, `page_content_four`, `page_content_one`, `page_content_three`, `page_content_two`, `page_customization_hash`, `parental_consent_status`, `parents_invited`, `publicly_viewable`, `rsvp_by`, `slug`, `start_time`, `state`, `status`, `step_id`, `theme_code`, `title`, `updated_at`, `user_id`) VALUES (NULL, NULL, NULL, NULL, 0, '2013-03-08 06:13:41', NULL, 1, NULL, NULL, 1, 1, NULL, 0, NULL, NULL, NULL, NULL, NULL, 1, NULL, NULL, NULL, NULL, NULL, 'notConfirmed', 'optional', 0, NULL, NULL, NULL, 'open', 'in_progress', 1, 'default', NULL, '2013-03-08 06:13:41', 24)
SELECT `packages`.* FROM `packages`
SELECT `states`.* FROM `states`
UPDATE `carts` SET `event_id` = 47, `updated_at` = '2013-03-08 06:13:42' WHERE `carts`.`id` = 104
---
  def new
    # handling to tell user if we found an existing event, but don't keep displaying the same notice... save it in a cookie
    if Event.users_in_progress_event(current_user)
      @event = Event.users_in_progress_event(current_user)
      if session[:existing_event_notice]==@event.id
        @existing_event_notice = false
      else
        @existing_event_notice = true
        session[:existing_event_notice] = @event.id
      end
    else
      @event = Event.create!({:user => current_user, :package => Package.free, :step => @steps.first, :state => 'open'})
    end
    @cart = current_cart # don't do this in before_filter, need to have event_id or might not find existing old cart
    @cart.update_attribute(:event_id, @event.id)

SELECT `events`.* FROM `events` WHERE `events`.`deleted_at` IS NULL AND `events`.`id` = 47 LIMIT 1
UPDATE `events` SET `step_id` = 2, `title` = 'b\'daya', `host_name` = 'baba', `child_full_name` = 'bibi', `child_pronoun` = 'female', `start_time` = '2000-01-01 15:45:00', `end_time` = '2000-01-01 10:30:00', `location_name` = 'sdasdasdsa', `location_address` = 'asdasdsad', `charity_donation_percent` = 0.5, `child_dob` = '2005-09-09 00:00:00', `event_date` = '2013-08-15 00:00:00', `rsvp_by` = '2013-08-04', `slug` = 'b-daya-47', `updated_at` = '2013-03-08 06:14:45' WHERE `events`.`id` = 47
---
  def update
    @steps = Step.all || not_found
    @event = Event.find(params[:id])
    respond_to do |format|
      if @event.update_attributes(params[:event])

SELECT `events`.* FROM `events` WHERE `events`.`deleted_at` IS NULL AND `events`.`id` = 47 LIMIT 1
---
  def steps_states
    @event = Event.find(params[:id])