app/controllers/pages_controller.rb

SELECT `pages`.* FROM `pages` WHERE `pages`.`slug` = 'system/pictures/images/000/000/091/mini/DoctorsWithoutBorders' LIMIT 1
---
  def show
    if params[:page]=='landing'   # temp, special handling
       render 'pages/landing_B'
    elsif params[:page]=='presskit'  # is there a better way to do this
       redirect_to '/ShareYourWish_EPK.pdf'
    elsif template_exists?(params[:page], ['pages'])
      render 'pages/' + params[:page]
    else
      @page = Page.find_by_slug(params[:page]) || not_found