app/controllers/pictures_controller.rb

  def create
    @picture = Picture.new(params[:picture])
    respond_to do |format|
      if @picture.save
---
INSERT INTO `pictures` (`created_at`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `imageable_id`, `imageable_type`, `layout_section`, `layout_slot`, `sort_order`, `updated_at`) VALUES ('2013-03-08 06:25:15', 'image/jpeg', '45894_502689236440678_1097191968_n.jpg', 39738, '2013-03-08 06:25:14', 47, 'event', NULL, NULL, NULL, '2013-03-08 06:25:15')